{
"home": {
	"title": "Making Heritage Data FAIR - Modelling with the CIDOC-CRM",
	"content": "<h3>Integrating documentation details and analytical data generated for an object</h3><br/><p>The National Gallery's contribution to the SSHOC project entails the creation of two <a href='https://www.go-fair.org/fair-principles/'>FAIR datasets</a> with resolvable URIs and persistent identifiers, linked together and to other external resources using the CIDOC-CRM. Within these datasets, specific attention is paid to mapping the relationships between objects using semantic technologies that are understandable both to human readers and to computer programmes. This site contains and displays initial examples from the mappings, and we welcome feedback on our understanding and implementation of the CRM.</p><!-- <center><a class=\"btn btn-outline-primary nav-button\" style=\"left:80px;\" id=\"nav-models\" role=\"button\" href=\"models.html\">Explore Models</a></center><br/>--><p><a href=\"http://www.cidoc-crm.org\"><img style=\"position:relative;width:75px;float:left;margin-right:5px;\" src=\"graphics/cidoccrm_logo.png\"/></a>All of the linking properties and classes presented in the included examples are taken from the current[@@January 2020] release and development version of the CIDOC-CRM[@@The CIDOC Conceptual Reference Model (CRM) is a theoretical and practical tool for information integration in the field of cultural heritage. - http://www.cidoc-crm.org . Current versions of the CIDOC CRM can be found at http://www.cidoc-crm.org/versions-of-the-cidoc-crm.] ontology. References to external control vocabularies or thesauri[@@The two main external LOD vocabularies/thesauri referenced in this document are the Getty’s AAT ( http://www.getty.edu/research/tools/vocabularies/aat ) and Wikidata ( https://www.wikidata.org )] have also been included to demonstrate how links between internal documentation systems and external resources could be modelled.</p>",
	"content right": "<img style=\"position:relative;width:100%;\" src=\"graphics/example_knowledge_graph.png\"/>"
	},
"CIDOC Models": {
	"title": "National Gallery - CIDOC CRM Modelling Examples",
	"content": "<b>This presentation does not cover all the possible relationships relating to conservation documentation but concentrates on examples of the main properties and values required to document and organise technical and analytical examinations of cultural heritage objects.</b> Therefore, the semantic description of objects, their creators and common events will be minimal and will not explore the additional concepts more specifically related to detailed conservation treatments, art history, provenance or exhibitions. However, in addition to the demonstrating the semantic relationships between data types the examples included in this document have been extended to demonstrate how real literal values, numbers, dates, names and text can be connected to the semantic model. The data included in this presentation has been taken from the online <a href=\"https://cima.ng-london.org.uk/documentation\">Raphael Research Resource</a>.</p><p>In the following examples each of the sets of relationships are presented in the form of a flow diagram, which indicates and explains the entities being linked together and the properties connecting them. At this time each flow diagram can be rendered in two different ways: one using an interactive 3D display (<a href=\"https://github.com/nylen/d3-process-map\">D3 Process Map</a>) and one using a simpler 2D presentation (<a href=\"https://github.com/mermaid-js/mermaid\">Mermaid</a>).",
	"content right": ""
	},
"Raphael Examples": {
  "title": "Examples based on the Raphael Research Resource",
  "parent": "CIDOC Models",
  "class": "modelling",	
  "file": [],
  "content": "<p>The four examples below represent key categories and relationships within the Raphael model. It is important to note that they are incomplete as presented here; i.e. relations exist in the model's code that have here been left out for the sake of clean visualisations. This is particularly the case for instances where a relation in the model references a node that would itself be at the centre of another visualisation, such as when, in the Digital Document model, paintings are referenced.</p><p>The examples provided here are intended as generics that stand in for other objects in their shared category. The mapping of NG1171, for example, can be taken to represent how any <b>painting</b> or <b>object</b> would be represented in CIDOC-CRM, and likewise the Raphael mapping is suggestive of how any <b>person/creator</b> would appear.</p><p>Within this presentation, in the most generic sense an <b>object</b> is any physical or conceptual thing that needs to be discussed, examined or described. This can include complete cultural heritage objects such as paintings, sculptures, books & manuscripts, shards of pot, or even whole buildings. A specific <b>object</b> can also be a fragment, section or part of a complete cultural heritage object, such as a painting stretcher, scraps of paper, pieces of broken sculpture, and flakes of glaze/paint, or even analytical samples that have been deliberately removed. Actual museum objects, like paintings, are composed of several different sub-objects, such as paint layers, canvas, nail, etc. All of these different sub-objects can be described individually, if required.</p><p>Within this presentation, in the most generic sense a <b>creator/actor</b> is any person, groups or organisation involved with or responsible for the activities in a given event. This can include artists, authors and even conservation scientists who might take a sample from an object or carry out analytical work.</p><p><b>Further events</b> in an object’s life can cover a wide range of activities, including the commissioning of the work, its movement, any alterations or conservation treatments, additional changes of ownership, etc. Describing, in detail, the full range of these <b>further events</b> goes beyond the scope of this presentation, but the generic relationships common to most of them have been described.</p><p>Providing a full list of all the possible types of objects and creators that may be considered within conservation documentation goes well beyond the scope of this presentation. Where appropriate reference to and use of existing vocabularies xviii will be used within this work-package to define or identify these types.</p><p><a href=\"https://www.tinyurl.com/w7heubru\">Painting Mapping</a></p><p><a href=\"https://www.tinyurl.com/52wf928c\">Sample Mapping</a></p><p><a href=\"https://www.tinyurl.com/yfefccwt\">Image Mapping</a></p>"
		}
}
